/**
*   Иванов Дмитрий
*       Т05-31
*/
#ifndef LAGRANGIAN_HPP_INCLUDED
#define LAGRANGIAN_HPP_INCLUDED
#include <iostream>
#include <vector>

using std::vector;


/******************************************************************************************
    полином Лагранжа
*******************************************************************************************/
double
LagrangeInterpolation(vector<double> &x,   // массив данных по х
                      vector<double> &y,   // массив знайчений функции
                      double _x);  // точка, в которой необходимо узнать знач. функции




/******************************************************************************************
    полином Ньютона
*******************************************************************************************/
double
NewtonInterpolation(vector<double> &x,     // массив данных по х
                    vector<double> &y,     // массив знайчений функции
                    double _x);    // точка, в которой необходимо узнать знач. функции

#endif // LAGRANGIAN_HPP_INCLUDED
