/**
*   Иванов Дмитрий
*       Т05-31
*/

#include "interpolation.hpp"




/******************************************************************************************
    полином Лагранжа
*******************************************************************************************/
double
LagrangeInterpolation(vector<double> &x,   // массив данных по х
                      vector<double> &y,   // массив знайчений функции
                      double _x)   // точка, в которой необходимо узнать знач. функции
{
	double res = 0;                // значение функции, изначально полагаем равным нулю.

	for (int i = 0; i < x.size(); i++)
	{
		double temp= 1;                // Лагранжиан i-ый
		for (int j = 0; j < x.size(); j++)
			if (i != j)                     // не учитываем x[i] - x[i], т.к. -> inf
				temp *= (_x - x[j])/(x[i] - x[j]);  // вычисление
		res += y[i] * temp;
	}
	return res;
}
